from selenium.webdriver.common.by import By
from selenium import webdriver

"""
 Миссия "Загадочный След"
Приветствую, будущие эксперты по web-парсингу! Сегодня у нас на очереди не просто задача,
а настоящая миссия, которую можно было бы назвать "Загадочный След".
Представьте себя детективами в мире веб-страниц: вам предстоит найти ключ к решению на странице,
используя его для "отпирания" секретов выпадающего списка, и в конце — раскрывать тайну последней загадки.

Задачи
Откройте Таинственную Страницу: Используя Selenium, откройте веб-страницу, где хранится первая подсказка.
Решение Загадки: Найдите значение математического уравнения.

Ключ к Выпадающему Списку: Откройте выпадающий список и выберите элемент с числом,
которое у вас получилось на предыдущем этапе.
Активация Механизма: Нажмите на кнопку на странице, если значение верное, вы получите код.
Завершение Миссии: Скопируйте число, которое появится на странице после нажатия на кнопку,
и вставьте его в поле ответа степик.
"""
# Инициализируем драйвер Chrome
with webdriver.Chrome() as browser:
    # Задаем значение математического уравнения
    n = 12434107696*6 + 1
    # Открываем веб-страницу по заданному URL
    browser.get('http://parsinger.ru/selenium/6/6.html')
    # Ищем элемент списка по TAG_NAME и отправляем переменную n как строку
    browser.find_element(By.TAG_NAME, 'select').send_keys(str(n))
    # Кликаем по кнопке "Отправить"
    browser.find_element(By.CLASS_NAME, 'btn').click()
    # Считываем полученное число и выводим на экран
    print("Число:", browser.find_element(By.ID, 'result').text)
