from selenium import webdriver
from selenium.webdriver.common.by import By

"""
Кодекс Охотников за Цифрами
Приветствую, будущие аналитики данных и веб-скрейперы!
Перед вами стоит задача, которая требует не только знаний в программировании, но и внимания к деталям.
Вам нужно "прочитать" секретный кодекс, спрятанный на веб-странице.
Кодекс разбит на 300 фрагментов и каждый из них хранится в отдельном теге <p>.
Ваша задача — собрать все эти фрагменты воедино.

Задачи
Вход в Лабиринт: Откройте указанный веб-сайт с помощью Selenium.
Ключи к Сокровищам: Извлеките данные из каждого тега <p> на странице.
Сложение Фрагментов: Просуммируйте все числовые значения, которые вы извлекли.
Отчет о Сокровищах: Запишите сумму в отдельное поле или выведите на экран.
"""

# URL веб-страницы для парсинга
url = 'https://parsinger.ru/selenium/3/3.html'
# Инициализируем драйвер Chrome
with webdriver.Chrome() as browser:
    # Открываем веб-страницу по заданному URL
    browser.get(url)
    # Переменной result присваиваем переменную x, считываем функцией text число, прогоняем в цикле через поиск элемента
    result = [int(x.text) for x in browser.find_elements(By.XPATH, "//div[@class='text']/p")]
    # Суммируем результат и выводим на экран
    print(sum(result))
