

"""
Операция "Минное поле"
Привет, будущие автоматизаторы! Сегодня у нас не просто задача, а настоящий тайм-триал,
испытание на скорость и точность! Мы переносимся в мир, где каждое неверное движение может стать последним... ну,
или по крайней мере, приведёт к неудачному выполнению задания.
Задача симулирует реальную рабочую ситуацию, в которой на скорость выполнения операций поставлен жесткий лимит.

Задачи
Стартовая Позиция: Используя Selenium, откройте заданный веб-сайт. Убедитесь, что ваша машина готова к операции.

Секунды на Счетчике: У вас есть ровно 5 секунд, чтобы пройтись по ячейкам на странице и очистить только те,
которые доступны для редактирования.
Проверка: Нажмите на кнопку "Проверить" на странице.
Секретный код: Из всплывающего алерт-окна скопируйте код и вставьте его в поле для ответа.
Для проверки доступности текстового поля, используйте проверку атрибута disabled у соответствующих текстовых полей:

.get_attribute('disabled')
"""

from selenium import webdriver
from selenium.webdriver.common.by import By
from selenium.webdriver.common.keys import Keys
import time

# Установка пути к драйверу selenium
# В данном случае будет использоваться Chrome
driver = webdriver.Chrome()

# Открытие веб-сайта
driver.get("https://parsinger.ru/selenium/5.5/2/1.html")

# Поиск всех текстовых полей на странице
text_fields = driver.find_elements(By.TAG_NAME, "input")

# Прохождение по каждому текстовому полю и очистка доступных для редактирования полей
for field in text_fields:
    if not field.get_attribute("disabled"):
        field.clear()

# Нажатие на кнопку "Проверить"
check_button = driver.find_element(By.ID, "checkButton")
check_button.click()

# Ожидание 2 секунд для появления алерт-окна
time.sleep(2)

# Получение текста алерт-окна
alert_text = driver.switch_to.alert.text

# Вывод текста алерт-окна на экран
print("Результат:", alert_text)

# Закрытие драйвера
driver.quit()

