from selenium import webdriver

"""
Охота на Скрытые Сокровища
Здравствуйте, искатели сокровищ во вселенной веб-страниц!
На этот раз перед вами стоит задача, которая напоминает охоту за сокровищем.
Но вместо того, чтобы копать ямы или искать клады на необитаемых островах,
вы будете "копать" информацию на веб-странице. Эта задача проверит вашу способность быть настойчивыми и терпеливыми,
потому что "сокровище" появляется довольно редко.

Задачи
Прибытие на "Остров": Используйте Selenium для открытия заданного веб-сайта.

Охота на Сокровище: В элементе с id="result" иногда появляется число — это и есть ваше сокровище.
Проблема в том, что оно появляется очень редко. Вам придется обновлять страницу множество раз,
пока не увидите это число.

Клад в Руках: Как только число появится, скопируйте его
и вставьте в предназначенное для этого поле ответа на вашем курсе.
"""

URL = 'https://parsinger.ru/methods/1/index.html'

with webdriver.Chrome() as browser:
    browser.get('https://parsinger.ru/methods/1/index.html')
    result = browser.find_element('id', 'result').text
    while result == 'refresh page':
        browser.refresh()
        result = browser.find_element('id', 'result').text
    print("Результат:", result)

