import time
from selenium import webdriver

"""
Кодовое имя: "Секретные печеньки"
Представьте себя хакером-белой шляпы, вооруженным навыками веб-скрапинга и автоматизации.
Ваша миссия, если вы её примете, — раскрывать секреты веб-сайтов, чтобы обеспечить их безопасность и устойчивость.
Не просто кодером, вы — кибердетектив. И вот ваше следующее задание:

Цель: Получить все секретные "cookies" с заданного веб-сайта и суммировать их числовые значения.
Эти "cookies" могут хранить важную информацию, например, ключи для доступа к секретным данным.
Ваши навыки веб-парсинга здесь будут более чем полезны.
 

Этапы миссии:

Вооружитесь браузером и пусть ваш код проникнет на сайт.
Поиск секретных cookies: Найдите все скрытые secret_cookie_, которые могут содержать важную информацию.


Дешифровка и анализ: Суммируйте числовые значения всех secret_cookie_.
Это может быть частью шифра или ключом к следующему уровню.
Ввод ответа: Вставьте полученную сумму в поле ответа степик. Это ваш ключ к успешному завершению миссии.

"""

with webdriver.Chrome() as browser:
    browser.get("https://parsinger.ru/methods/3/index.html")
    time.sleep(0.3)

    print("Результат:", sum([int(cookie['value']) for cookie in browser.get_cookies()]))

